Catalogs/КИИ_СхемыОтветаИИ.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>КИИ_СхемыОтветаИИ</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ИмяСхемы</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Описание</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВалидаторОтвета</Name>
					<Comment>Доверенный валидатор для проверки всего ответа</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.КИИ_ВалидаторыОтветаИИ</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Свойства</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Имя</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Тип</Name>
							<Type>
								<v8:Type>cfg:EnumRef.КИИ_ТипыПолейСхемыОтветаИИ</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Обязательное</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Описание</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ФорматЗначения</Name>
							<Comment>Например ДД.ММ.ГГГГ для даты</Comment>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПутьРодителя</Name>
							<Comment>Точечный путь для вложенных свойств</Comment>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>200</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВалидаторПоля</Name>
							<Comment>Доверенный валидатор для проверки поля</Comment>
							<Type>
								<v8:Type>cfg:CatalogRef.КИИ_ВалидаторыОтветаИИ</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВложеннаяСхема</Name>
							<Comment>Для типов Объект и Массив</Comment>
							<Type>
								<v8:Type>cfg:CatalogRef.КИИ_СхемыОтветаИИ</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Enums/КИИ_ТипыПолейСхемыОтветаИИ.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>КИИ_ТипыПолейСхемыОтветаИИ</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Строка</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Число</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Целое</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Булево</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Объект</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Массив</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Catalogs/КИИ_ВалидаторыОтветаИИ.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>КИИ_ВалидаторыОтветаИИ</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Описание</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КодВалидации</Name>
					<Comment>Доверенный код 1С для проверки ответа или поля</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Назначение</Name>
					<Comment>Для отбора в формах; на исполнение не влияет</Comment>
					<Type>
						<v8:Type>cfg:EnumRef.КИИ_НазначенияВалидатораОтветаИИ</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Catalogs/КИИ_СхемыОтветаИИ/Ext/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

// Возвращает данные схемы ответа из метаданных: шапку и табличную часть свойств.
//
// Параметры:
//  СхемаОтвета - СправочникСсылка.КИИ_СхемыОтветаИИ
//
// Возвращаемое значение:
//  Структура:
//   * Ссылка - СправочникСсылка.КИИ_СхемыОтветаИИ
//   * ИмяСхемы - Строка
//   * Описание - Строка
//   * ВалидаторОтвета - СправочникСсылка.КИИ_ВалидаторыОтветаИИ
//   * Свойства - Массив из Структура - строки табличной части Свойства
//
Функция ПолучитьДанныеСхемы(СхемаОтвета) Экспорт

	Если Не ЗначениеЗаполнено(СхемаОтвета) Тогда
		ВызватьИсключение НСтр("ru = 'Не указана схема ответа ИИ'");
	КонецЕсли;

	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	Схемы.Ссылка КАК Ссылка,
	|	Схемы.ИмяСхемы КАК ИмяСхемы,
	|	Схемы.Описание КАК Описание,
	|	Схемы.ВалидаторОтвета КАК ВалидаторОтвета
	|ИЗ
	|	Справочник.КИИ_СхемыОтветаИИ КАК Схемы
	|ГДЕ
	|	Схемы.Ссылка = &СхемаОтвета
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Свойства.Имя КАК Имя,
	|	Свойства.Тип КАК Тип,
	|	Свойства.Обязательное КАК Обязательное,
	|	Свойства.Описание КАК Описание,
	|	Свойства.ФорматЗначения КАК ФорматЗначения,
	|	Свойства.ПутьРодителя КАК ПутьРодителя,
	|	Свойства.ВалидаторПоля КАК ВалидаторПоля,
	|	Свойства.ВложеннаяСхема КАК ВложеннаяСхема,
	|	Свойства.НомерСтроки КАК НомерСтроки
	|ИЗ
	|	Справочник.КИИ_СхемыОтветаИИ.Свойства КАК Свойства
	|ГДЕ
	|	Свойства.Ссылка = &СхемаОтвета
	|
	|УПОРЯДОЧИТЬ ПО
	|	Свойства.НомерСтроки";

	Запрос.УстановитьПараметр("СхемаОтвета", СхемаОтвета);

	РезультатЗапроса = Запрос.ВыполнитьПакет();

	ВыборкаШапка = РезультатЗапроса[0].Выбрать();

	Если Не ВыборкаШапка.Следующий() Тогда
		ВызватьИсключение НСтр("ru = 'Схема ответа ИИ не найдена'");
	КонецЕсли;

	ДанныеСхемы = Новый Структура;
	ДанныеСхемы.Вставить("Ссылка", ВыборкаШапка.Ссылка);
	ДанныеСхемы.Вставить("ИмяСхемы", ВыборкаШапка.ИмяСхемы);
	ДанныеСхемы.Вставить("Описание", ВыборкаШапка.Описание);
	ДанныеСхемы.Вставить("ВалидаторОтвета", ВыборкаШапка.ВалидаторОтвета);
	ДанныеСхемы.Вставить("Свойства", Новый Массив);

	ВыборкаСвойства = РезультатЗапроса[1].Выбрать();

	Пока ВыборкаСвойства.Следующий() Цикл

		СтрокаСвойства = Новый Структура;
		СтрокаСвойства.Вставить("Имя", ВыборкаСвойства.Имя);
		СтрокаСвойства.Вставить("Тип", ВыборкаСвойства.Тип);
		СтрокаСвойства.Вставить("Обязательное", ВыборкаСвойства.Обязательное);
		СтрокаСвойства.Вставить("Описание", ВыборкаСвойства.Описание);
		СтрокаСвойства.Вставить("ФорматЗначения", ВыборкаСвойства.ФорматЗначения);
		СтрокаСвойства.Вставить("ПутьРодителя", НормализоватьПутьПоля(ВыборкаСвойства.ПутьРодителя));
		СтрокаСвойства.Вставить("ВалидаторПоля", ВыборкаСвойства.ВалидаторПоля);
		СтрокаСвойства.Вставить("ВложеннаяСхема", ВыборкаСвойства.ВложеннаяСхема);
		СтрокаСвойства.Вставить("НомерСтроки", ВыборкаСвойства.НомерСтроки);

		ДанныеСхемы.Свойства.Добавить(СтрокаСвойства);

	КонецЦикла;

	Возврат ДанныеСхемы;

КонецФункции

// Возвращает ссылку на валидатор всего ответа модели.
//
// Параметры:
//  СхемаОтвета - СправочникСсылка.КИИ_СхемыОтветаИИ
//  КэшСхем - Соответствие - опциональный кэш данных схем, чтобы избежать повторного чтения из БД.
//
// Возвращаемое значение:
//  СправочникСсылка.КИИ_ВалидаторыОтветаИИ
//
Функция ВалидаторОтвета(СхемаОтвета, КэшСхем = Неопределено) Экспорт

	Если КэшСхем = Неопределено Тогда
		Возврат ОбщегоНазначения.ЗначениеРеквизитаОбъекта(СхемаОтвета, "ВалидаторОтвета");
	КонецЕсли;

	ДанныеСхемы = ПолучитьДанныеСхемыИзКэша(СхемаОтвета, КэшСхем);

	Возврат ДанныеСхемы.ВалидаторОтвета;

КонецФункции

// Возвращает доверенный код валидации всего ответа модели.
//
// Параметры:
//  СхемаОтвета - СправочникСсылка.КИИ_СхемыОтветаИИ
//  КэшСхем - Соответствие - опциональный кэш данных схем, чтобы избежать повторного чтения из БД.
//
// Возвращаемое значение:
//  Строка
//
Функция КодВалидацииОтвета(СхемаОтвета, КэшСхем = Неопределено) Экспорт

	Валидатор = ВалидаторОтвета(СхемаОтвета, КэшСхем);

	Возврат Справочники.КИИ_ВалидаторыОтветаИИ.КодВалидации(Валидатор);

КонецФункции

// Возвращает описания полей с доверенным кодом валидации.
// Код валидации не включается в JSON Schema для модели.
//
// Параметры:
//  СхемаОтвета - СправочникСсылка.КИИ_СхемыОтветаИИ
//  КэшСхем - Соответствие - опциональный кэш данных схем, чтобы избежать повторного чтения из БД.
//
// Возвращаемое значение:
//  Массив из Структура:
//   * Имя - Строка
//   * ПутьРодителя - Строка
//   * ПутьКПолю - Строка - полный путь в JSON (точечная нотация)
//   * Валидатор - СправочникСсылка.КИИ_ВалидаторыОтветаИИ
//   * НомерСтроки - Число
//
Функция ПолучитьВалидаторыПолей(СхемаОтвета, КэшСхем = Неопределено) Экспорт

	Если КэшСхем = Неопределено Тогда
		ДанныеСхемы = ПолучитьДанныеСхемы(СхемаОтвета);
	Иначе
		ДанныеСхемы = ПолучитьДанныеСхемыИзКэша(СхемаОтвета, КэшСхем);
	КонецЕсли;

	Валидаторы = Новый Массив;

	Для Каждого СтрокаСвойства Из ДанныеСхемы.Свойства Цикл

		Если Не ЗначениеЗаполнено(СтрокаСвойства.ВалидаторПоля) Тогда
			Продолжить;
		КонецЕсли;

		Валидатор = Новый Структура;
		Валидатор.Вставить("Имя", СтрокаСвойства.Имя);
		Валидатор.Вставить("ПутьРодителя", СтрокаСвойства.ПутьРодителя);
		Валидатор.Вставить("ПутьКПолю", СформироватьПолныйПутьПоля(СтрокаСвойства.ПутьРодителя, СтрокаСвойства.Имя));
		Валидатор.Вставить("Валидатор", СтрокаСвойства.ВалидаторПоля);
		Валидатор.Вставить("НомерСтроки", СтрокаСвойства.НомерСтроки);

		Валидаторы.Добавить(Валидатор);

	КонецЦикла;

	Возврат Валидаторы;

КонецФункции

// Формирует JSON Schema по данным метаданных схемы.
//
// Параметры:
//  СхемаОтвета - СправочникСсылка.КИИ_СхемыОтветаИИ
//
// Возвращаемое значение:
//  Структура - JSON Schema корневого объекта
//
Функция СформироватьJsonSchema(СхемаОтвета) Экспорт

	КэшСхем = Новый Соответствие;
	ЦепочкаСсылок = Новый Массив;

	ДанныеСхемы = ПолучитьДанныеСхемыИзКэша(СхемаОтвета, КэшСхем);

	Возврат СформироватьJsonSchemaПоДанным(ДанныеСхемы, КэшСхем, ЦепочкаСсылок);

КонецФункции

// Формирует структуру response_format для AI Studio (json_schema).
//
// Параметры:
//  СхемаОтвета - СправочникСсылка.КИИ_СхемыОтветаИИ
//
// Возвращаемое значение:
//  Структура:
//   * type - Строка - "json_schema"
//   * json_schema - Структура:
//       ** name - Строка
//       ** schema - Структура - JSON Schema
//
Функция СформироватьResponseFormat(СхемаОтвета) Экспорт

	КэшСхем = Новый Соответствие;
	ЦепочкаСсылок = Новый Массив;

	ДанныеСхемы = ПолучитьДанныеСхемыИзКэша(СхемаОтвета, КэшСхем);
	ИмяСхемы = ПолучитьИмяJsonSchema(ДанныеСхемы);
	JsonSchema = СформироватьJsonSchemaПоДанным(ДанныеСхемы, КэшСхем, ЦепочкаСсылок);

	JsonSchemaКонтейнер = Новый Структура;
	JsonSchemaКонтейнер.Вставить("name", ИмяСхемы);
	JsonSchemaКонтейнер.Вставить("schema", JsonSchema);

	ResponseFormat = Новый Структура;
	ResponseFormat.Вставить("type", "json_schema");
	ResponseFormat.Вставить("json_schema", JsonSchemaКонтейнер);

	Возврат ResponseFormat;

КонецФункции

// Возвращает массив допустимых значений реквизита Свойства.ФорматЗначения.
// Используется в обработчике ПередЗаписью модуля объекта справочника и в коде,
// программно создающем схемы. Пустая строка означает «без специальной форматной проверки».
//
// Возвращаемое значение:
//  Массив из Строка
//
Функция ДопустимыеФорматыЗначения() Экспорт

	Результат = Новый Массив;
	Результат.Добавить("");
	Результат.Добавить("ДД.ММ.ГГГГ");

	Возврат Результат;

КонецФункции

// Возвращает имя типа JSON Schema для значения перечисления типов полей.
//
// Параметры:
//  ТипПоля - ПеречислениеСсылка.КИИ_ТипыПолейСхемыОтветаИИ
//
// Возвращаемое значение:
//  Строка - "string", "number", "integer", "boolean", "object", "array" или пустая строка
//
Функция ТипПоляJsonSchema(ТипПоля) Экспорт

	Если ТипПоля = Перечисления.КИИ_ТипыПолейСхемыОтветаИИ.Строка Тогда
		Возврат "string";
	ИначеЕсли ТипПоля = Перечисления.КИИ_ТипыПолейСхемыОтветаИИ.Число Тогда
		Возврат "number";
	ИначеЕсли ТипПоля = Перечисления.КИИ_ТипыПолейСхемыОтветаИИ.Целое Тогда
		Возврат "integer";
	ИначеЕсли ТипПоля = Перечисления.КИИ_ТипыПолейСхемыОтветаИИ.Булево Тогда
		Возврат "boolean";
	ИначеЕсли ТипПоля = Перечисления.КИИ_ТипыПолейСхемыОтветаИИ.Объект Тогда
		Возврат "object";
	ИначеЕсли ТипПоля = Перечисления.КИИ_ТипыПолейСхемыОтветаИИ.Массив Тогда
		Возврат "array";
	КонецЕсли;

	Возврат "";

КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция ПолучитьДанныеСхемыИзКэша(СхемаОтвета, КэшСхем)

	ДанныеСхемы = КэшСхем.Получить(СхемаОтвета);

	Если ДанныеСхемы = Неопределено Тогда
		ДанныеСхемы = ПолучитьДанныеСхемы(СхемаОтвета);
		КэшСхем.Вставить(СхемаОтвета, ДанныеСхемы);
	КонецЕсли;

	Возврат ДанныеСхемы;

КонецФункции

Функция СформироватьJsonSchemaПоДанным(ДанныеСхемы, КэшСхем, ЦепочкаСсылок)

	СхемаОбъекта = СформироватьСхемуОбъекта(ДанныеСхемы, "", КэшСхем, ЦепочкаСсылок);

	Если ЗначениеЗаполнено(ДанныеСхемы.Описание) Тогда
		СхемаОбъекта.Вставить("description", ДанныеСхемы.Описание);
	КонецЕсли;

	Возврат СхемаОбъекта;

КонецФункции

Функция ПолучитьИмяJsonSchema(ДанныеСхемы)

	ИмяСхемы = СокрЛП(ДанныеСхемы.ИмяСхемы);

	Если ЗначениеЗаполнено(ИмяСхемы) Тогда
		Возврат ИмяСхемы;
	КонецЕсли;

	Возврат Строка(ДанныеСхемы.Ссылка.УникальныйИдентификатор());

КонецФункции

Функция СформироватьСхемуОбъекта(ДанныеСхемы, ПутьРодителя, КэшСхем, ЦепочкаСсылок)

	ПроверитьЦиклическуюСсылку(ДанныеСхемы.Ссылка, ЦепочкаСсылок);

	Свойства = Новый Структура;
	Обязательные = Новый Массив;
	НормализованныйПутьРодителя = НормализоватьПутьПоля(ПутьРодителя);

	Для Каждого СтрокаСвойства Из ДанныеСхемы.Свойства Цикл

		Если СтрокаСвойства.ПутьРодителя <> НормализованныйПутьРодителя Тогда
			Продолжить;
		КонецЕсли;

		Если ПустаяСтрока(СокрЛП(СтрокаСвойства.Имя)) Тогда
			Продолжить;
		КонецЕсли;

		СхемаПоля = СформироватьСхемуПоля(СтрокаСвойства, ДанныеСхемы, КэшСхем, ЦепочкаСсылок);
		Свойства.Вставить(СтрокаСвойства.Имя, СхемаПоля);

		Если СтрокаСвойства.Обязательное Тогда
			Обязательные.Добавить(СтрокаСвойства.Имя);
		КонецЕсли;

	КонецЦикла;

	СхемаОбъекта = Новый Структура;
	СхемаОбъекта.Вставить("type", "object");
	СхемаОбъекта.Вставить("properties", Свойства);
	СхемаОбъекта.Вставить("additionalProperties", Ложь);

	Если Обязательные.Количество() > 0 Тогда
		СхемаОбъекта.Вставить("required", Обязательные);
	КонецЕсли;

	Возврат СхемаОбъекта;

КонецФункции

Функция СформироватьСхемуПоля(СтрокаСвойства, ДанныеСхемы, КэшСхем, ЦепочкаСсылок)

	ТипJson = ТипПоляJsonSchema(СтрокаСвойства.Тип);

	Если ПустаяСтрока(ТипJson) Тогда
		ВызватьИсключение СтрШаблон(
			НСтр("ru = 'Для свойства ""%1"" не задан тип JSON Schema'"),
			СтрокаСвойства.Имя);
	КонецЕсли;

	Если СтрокаСвойства.Тип = Перечисления.КИИ_ТипыПолейСхемыОтветаИИ.Объект Тогда
		Возврат СформироватьСхемуПоляОбъект(СтрокаСвойства, ДанныеСхемы, КэшСхем, ЦепочкаСсылок);
	КонецЕсли;

	Если СтрокаСвойства.Тип = Перечисления.КИИ_ТипыПолейСхемыОтветаИИ.Массив Тогда
		Возврат СформироватьСхемуПоляМассив(СтрокаСвойства, ДанныеСхемы, КэшСхем, ЦепочкаСсылок);
	КонецЕсли;

	СхемаПоля = Новый Структура;
	СхемаПоля.Вставить("type", ТипJson);

	ДобавитьОписаниеПоля(СхемаПоля, СтрокаСвойства);
	ДобавитьФорматПоля(СхемаПоля, СтрокаСвойства);

	Возврат СхемаПоля;

КонецФункции

Функция СформироватьСхемуПоляОбъект(СтрокаСвойства, ДанныеСхемы, КэшСхем, ЦепочкаСсылок)

	НоваяЦепочка = СкопироватьЦепочкуСсылок(ЦепочкаСсылок);

	Если ЗначениеЗаполнено(СтрокаСвойства.ВложеннаяСхема) Тогда

		НоваяЦепочка.Добавить(ДанныеСхемы.Ссылка);
		ДанныеВложеннойСхемы = ПолучитьДанныеСхемыИзКэша(СтрокаСвойства.ВложеннаяСхема, КэшСхем);
		СхемаОбъекта = СформироватьСхемуОбъекта(ДанныеВложеннойСхемы, "", КэшСхем, НоваяЦепочка);

	Иначе

		ДочернийПуть = СформироватьДочернийПуть(СтрокаСвойства.ПутьРодителя, СтрокаСвойства.Имя);
		СхемаОбъекта = СформироватьСхемуОбъекта(ДанныеСхемы, ДочернийПуть, КэшСхем, НоваяЦепочка);

	КонецЕсли;

	ДобавитьОписаниеПоля(СхемаОбъекта, СтрокаСвойства);

	Возврат СхемаОбъекта;

КонецФункции

Функция СформироватьСхемуПоляМассив(СтрокаСвойства, ДанныеСхемы, КэшСхем, ЦепочкаСсылок)

	НоваяЦепочка = СкопироватьЦепочкуСсылок(ЦепочкаСсылок);

	Если ЗначениеЗаполнено(СтрокаСвойства.ВложеннаяСхема) Тогда

		НоваяЦепочка.Добавить(ДанныеСхемы.Ссылка);
		ДанныеВложеннойСхемы = ПолучитьДанныеСхемыИзКэша(СтрокаСвойства.ВложеннаяСхема, КэшСхем);
		СхемаЭлемента = СформироватьСхемуЭлементаМассива(ДанныеВложеннойСхемы, КэшСхем, НоваяЦепочка);

	Иначе

		ДочернийПуть = СформироватьДочернийПуть(СтрокаСвойства.ПутьРодителя, СтрокаСвойства.Имя);
		СхемаЭлемента = СформироватьСхемуЭлементаМассиваПоПути(ДанныеСхемы, ДочернийПуть, КэшСхем, НоваяЦепочка);

	КонецЕсли;

	СхемаМассива = Новый Структура;
	СхемаМассива.Вставить("type", "array");
	СхемаМассива.Вставить("items", СхемаЭлемента);

	ДобавитьОписаниеПоля(СхемаМассива, СтрокаСвойства);

	Возврат СхемаМассива;

КонецФункции

Функция СформироватьСхемуЭлементаМассива(ДанныеСхемы, КэшСхем, ЦепочкаСсылок)

	КорневыеСвойства = ОтфильтроватьСвойстваПоПути(ДанныеСхемы.Свойства, "");

	Если КорневыеСвойства.Количество() = 1
		И КорневыеСвойства[0].Тип <> Перечисления.КИИ_ТипыПолейСхемыОтветаИИ.Объект
		И КорневыеСвойства[0].Тип <> Перечисления.КИИ_ТипыПолейСхемыОтветаИИ.Массив Тогда

		Возврат СформироватьСхемуПоля(КорневыеСвойства[0], ДанныеСхемы, КэшСхем, ЦепочкаСсылок);

	КонецЕсли;

	Возврат СформироватьСхемуОбъекта(ДанныеСхемы, "", КэшСхем, ЦепочкаСсылок);

КонецФункции

Функция СформироватьСхемуЭлементаМассиваПоПути(ДанныеСхемы, ПутьЭлемента, КэшСхем, ЦепочкаСсылок)

	СвойстваЭлемента = ОтфильтроватьСвойстваПоПути(ДанныеСхемы.Свойства, ПутьЭлемента);

	Если СвойстваЭлемента.Количество() = 1
		И СвойстваЭлемента[0].Тип <> Перечисления.КИИ_ТипыПолейСхемыОтветаИИ.Объект
		И СвойстваЭлемента[0].Тип <> Перечисления.КИИ_ТипыПолейСхемыОтветаИИ.Массив Тогда

		Возврат СформироватьСхемуПоля(СвойстваЭлемента[0], ДанныеСхемы, КэшСхем, ЦепочкаСсылок);

	КонецЕсли;

	Возврат СформироватьСхемуОбъекта(ДанныеСхемы, ПутьЭлемента, КэшСхем, ЦепочкаСсылок);

КонецФункции

Функция ОтфильтроватьСвойстваПоПути(Свойства, ПутьРодителя)

	Результат = Новый Массив;
	НормализованныйПуть = НормализоватьПутьПоля(ПутьРодителя);

	Для Каждого СтрокаСвойства Из Свойства Цикл

		Если СтрокаСвойства.ПутьРодителя = НормализованныйПуть Тогда
			Результат.Добавить(СтрокаСвойства);
		КонецЕсли;

	КонецЦикла;

	Возврат Результат;

КонецФункции

Функция СкопироватьЦепочкуСсылок(ЦепочкаСсылок)

	НоваяЦепочка = Новый Массив;

	Для Каждого ЭлементЦепочки Из ЦепочкаСсылок Цикл
		НоваяЦепочка.Добавить(ЭлементЦепочки);
	КонецЦикла;

	Возврат НоваяЦепочка;

КонецФункции

Процедура ДобавитьОписаниеПоля(СхемаПоля, СтрокаСвойства)

	Если ЗначениеЗаполнено(СтрокаСвойства.Описание) Тогда
		СхемаПоля.Вставить("description", СтрокаСвойства.Описание);
	КонецЕсли;

КонецПроцедуры

Процедура ДобавитьФорматПоля(СхемаПоля, СтрокаСвойства)

	ФорматЗначения = СокрЛП(СтрокаСвойства.ФорматЗначения);

	Если ПустаяСтрока(ФорматЗначения) Тогда
		Возврат;
	КонецЕсли;

	Если ФорматЗначения = "ДД.ММ.ГГГГ" Тогда
		СхемаПоля.Вставить("pattern", "^(0[1-9]|[12][0-9]|3[01])\\.(0[1-9]|1[0-2])\\.(19|20)\\d{2}$");
		Возврат;
	КонецЕсли;

	СхемаПоля.Вставить("format", ФорматЗначения);

КонецПроцедуры

Процедура ПроверитьЦиклическуюСсылку(СсылкаСхемы, ЦепочкаСсылок)

	Если ЦепочкаСсылок.Найти(СсылкаСхемы) <> Неопределено Тогда
		ВызватьИсключение НСтр("ru = 'Обнаружена циклическая ссылка между схемами ответа ИИ'");
	КонецЕсли;

КонецПроцедуры

Функция НормализоватьПутьПоля(ПутьПоля)

	Возврат СокрЛП(ПутьПоля);

КонецФункции

Функция СформироватьДочернийПуть(ПутьРодителя, ИмяПоля)

	НормализованныйПуть = НормализоватьПутьПоля(ПутьРодителя);

	Если ПустаяСтрока(НормализованныйПуть) Тогда
		Возврат СокрЛП(ИмяПоля);
	КонецЕсли;

	Возврат НормализованныйПуть + "." + СокрЛП(ИмяПоля);

КонецФункции

// Публичный (внутри модуля) псевдоним СформироватьДочернийПуть, оставлен ради совместимости
// имени поля ПутьКПолю в структуре результата ПолучитьВалидаторыПолей.
//
Функция СформироватьПолныйПутьПоля(ПутьРодителя, ИмяПоля)

	Возврат СформироватьДочернийПуть(ПутьРодителя, ИмяПоля);

КонецФункции

#КонецОбласти

#КонецЕсли
